Repository: quarkusio/es.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: es_es

source: This guide covers how to deploy a native application on Kubernetes.
es_es: Esta guía cubre cómo desplegar una aplicación nativa en Kubernetes.

source: This guide covers:
es_es: Esta guía abarca:

source: This guide demonstrates how your Quarkus application can utilize SmallRye Reactive Messaging to interact with AMQP 1.0.
es_es: Esta guía demuestra cómo su aplicación Quarkus puede utilizar SmallRye Reactive Messaging para interactuar con AMQP 1.0.

source: This guide explains how your Quarkus application can read configuration properties at runtime from the https://cloud.spring.io/spring-cloud-config[Spring Cloud Config Server].
es_es: Esta guía explica cómo su aplicación Quarkus puede leer las propiedades de configuración en tiempo de ejecución desde el https://cloud.spring.io/spring-cloud-config[Servidor de Configuración de Spring Cloud].

source: This guide will take as input a native application developed in the xref:building-native-image.adoc[building native image guide].
es_es: Esta guía tomará como entrada una aplicación nativa desarrollada en la xref:building-native-image.html[guía de construcción de imágenes nativas].

source: This guide will take as input an application developed in the xref:getting-started.adoc[Getting Started guide].
es_es: Esta guía tomará como entrada una aplicación desarrollada en la xref:getting-started.html[guía de inicio].

source: This index is created by default on the project on which Quarkus is configured for, thanks to our Maven and Gradle plugins.
es_es: Este índice se crea por defecto en el proyecto en el que se configura Quarkus, gracias a nuestros plugins de Maven y Gradle.

source: This is a standard Kubernetes service definition YAML file.
es_es: Se trata de un archivo YAML estándar de definición de servicios de Kubernetes.

source: This is enabled by default, and can be disabled via `quarkus.test.only-test-application-module=true`.
es_es: Está activada por defecto, y puede desactivarse a través de `quarkus.test.only-test-application-module=true`.

source: This is helpful for both Java developers who are used to working with the imperative model and don’t want to switch things up, and those working with a cloud-native/reactive approach. The Quarkus development model can adapt itself to whatever app you’re developing.
es_es: Esto es útil tanto para los desarrolladores de Java que están acostumbrados a trabajar con el modelo imperativo y no quieren cambiar las cosas, como para los que trabajan con un enfoque nativo en la nube/reactivo. El modelo de desarrollo de Quarkus puede adaptarse a cualquier aplicación que estés desarrollando.

source: This is not directly related to testing, but allows you to turn live reload on and off.
es_es: Esto no está directamente relacionado con las pruebas, pero le permite activar y desactivar la recarga en vivo.

source: This means that Cloud Build is not activated yet. To overcome this error, open the URL shown in the error, follow the instructions and then wait a few minutes before retrying the command.
es_es: Esto significa que Cloud Build aún no está activado. Para superar este error, abra la URL que se muestra en el error, siga las instrucciones y luego espere unos minutos antes de volver a intentar el comando.

source: This mightily important feature needs no introduction and has already been mentioned in the <<architectural-differences, architectural differences>> section.
es_es: Esta característica tan importante no necesita presentación y ya se ha mencionado en la sección de <<architectural-differences, architectural differences>>.

source: This page explains how to enable xDS gRPC usage in your Quarkus application.
es_es: Esta página explica cómo habilitar el uso de xDS gRPC en su aplicación Quarkus.

source: This page lists all the Dev Services that Quarkus supports.
es_es: Esta página enumera todos los servicios de desarrollo que soporta Quarkus.

source: This project follows the <a href="#">all-contributors</a> specification. Contributions of any kind welcome!
es_es: Este proyecto sigue la especificación <a href="#">todos-colaboradores</a>. ¡Las contribuciones de cualquier tipo son bienvenidas!

source: This service provides scalability out of the box for web applications. If more instances are required, it will provide a load-balancing automatically, plus monitoring, metrics, logging and so on.
es_es: Este servicio proporciona escalabilidad de forma inmediata para las aplicaciones web. Si se necesitan más instancias, proporcionará un equilibrio de carga automáticamente, además de monitorización, métricas, registro, etc.

source: This transitively adds `io.quarkus:quarkus-grpc` extension dependency.
es_es: Esto añade transitoriamente la dependencia de la extensión `io.quarkus:quarkus-grpc`.

source: This will add the following to your build file:
es_es: Esto añadirá lo siguiente a su archivo de construcción:

source: This will disable all access checks, which allows the test to access secured endpoints without needing to authenticate.
es_es: Esto deshabilitará todas las comprobaciones de acceso, lo que permite que la prueba acceda a endpoints seguros sin necesidad de autenticarse.

source: This will provide you a URL similar to e.g.: `http://broker-ingress.knative-eventing.svc.cluster.local/knativetutorial/default`. Remember this URL.
es_es: Esto le proporcionará una URL similar a, por ejemplo `http://broker-ingress.knative-eventing.svc.cluster.local/knativetutorial/default`. Recuerde esta URL.

source: This will re-run every failing test
es_es: Esto volverá a ejecutar cada prueba que falle

source: This will re-run every test
es_es: Esto volverá a ejecutar todas las pruebas

source: To access the REST endpoint via curl, run:
es_es: Para acceder al endpoint REST mediante curl, ejecute:

source: To be able to set the address per message, the connector is using an _anonymous sender_.
es_es: Para poder establecer la dirección por mensaje, el conector utiliza un _remitente anónimo_.

source: To build a container image for your project, `quarkus.container-image.build=true` needs to be set using any of the ways that Quarkus supports.
es_es: Para construir una imagen de contenedor para su proyecto, `quarkus.container-image.build=true` necesita ser configurado usando cualquiera de las formas que Quarkus soporta.

source: To create the _processor_ project, from the same directory, run:
es_es: Para crear el proyecto del _procesador_, desde el mismo directorio, ejecute:

source: To create the _producer_ project, in a terminal run:
es_es: Para crear el proyecto _productor_, en un terminal ejecute:

source: To deploy your Quarkus Native container image to this service, follow this tutorial:
es_es: Para desplegar su imagen de contenedor Quarkus Native en este servicio, siga este tutorial:

source: To ease the user experience throughout this guide, it is better to have the Azure CLI installed and authenticated.
es_es: Para facilitar la experiencia del usuario a lo largo de esta guía, es mejor tener la CLI de Azure instalada y autenticada.

source: To enable YAML configuration, add the `quarkus-config-yaml` extension:
es_es: Para activar la configuración de YAML, añada la extensión `quarkus-config-yaml`:

source: To enable client xDS, use the following configuration.
es_es: Para activar xDS de cliente, utilice la siguiente configuración.

source: To enable server xDS, use the following configuration.
es_es: Para activar el servidor xDS, utilice la siguiente configuración.

source: To enable this security feature, add this to your `application.properties` file:
es_es: Para activar esta función de seguridad, añada esto a su archivo `application.properties`:

source: To get started with security in Quarkus, consider combining the Quarkus built-in Basic HTTP authentication with the Jakarta Persistence identity provider to enable role-based access control (RBAC).
es_es: Para comenzar con la seguridad en Quarkus, considere combinar la autenticación HTTP básica incorporada en Quarkus con el proveedor de identidad Jakarta Persistence para habilitar el control de acceso basado en roles (RBAC).

source: To migrate from 3.2, please refer to https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.3[our migration guide].
es_es: Para migrar desde la versión 3.2, por favor consulta https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.3[nuestra guía de migración].

source: To push a container image for your project, `quarkus.container-image.push=true` needs to be set using any of the ways that Quarkus supports.
es_es: Para subir una imagen de contenedor para su proyecto, `quarkus.container-image.push=true` necesita ser establecido usando cualquiera de las formas que Quarkus soporta.

source: To receive messages from RabbitMQ:
es_es: Para recibir mensajes de RabbitMQ:

source: To run your applications as native, first we need to build the native executables:
es_es: Para ejecutar tus aplicaciones como nativas, primero tenemos que construir los ejecutables nativos:

source: To schedule a Job execution, please refer to the quarkus.jberet.job.”job-name”.cron and quarkus.jberet.job.”job-name”.params.”param-key” configurations.
es_es: Para programar la ejecución de un trabajo, consulte las configuraciones quarkus.jberet.job."nombre-del-trabajo".cron y quarkus.jberet.job."nombre-del-trabajo".params."param-key".

source: To see the `usage` statement, and validate AWS configuration:
es_es: Para ver la declaración `usage`, y validar la configuración de AWS:

source: To send messages to RabbitMQ:
es_es: Para enviar mensajes a RabbitMQ:

source: To start using the Liquibase MongoDB Extension with your project, you just need to:
es_es: Para empezar a utilizar la extensión Liquibase MongoDB con su proyecto, sólo tiene que:

source: To test, run it by exposing port 80 into port 8080 in your host:
es_es: Para probarlo, ejecútelo exponiendo el puerto 80 en el puerto 8080 en su host:

source: To update to Quarkus 3.3.1, we recommend updating to the latest version of the Quarkus CLI and run:
es_es: Para actualizar a Quarkus 3.3.1, recomendamos actualizar a la última versión de la CLI de Quarkus y ejecutar:

source: To upload this image to your ACR, you must tag and push the image under the ACR login server. To find the login server of the Azure Container Registry, run this command:
es_es: Para subir esta imagen a su ACR, debe etiquetar y empujar la imagen bajo el servidor de inicio de sesión del ACR. Para encontrar el servidor de inicio de sesión del Azure Container Registry, ejecute este comando:

source: To upload, now do:
es_es: Para subir, hazlo ahora:

source: To use a `MULTICAST` queue, you need to provide the _FQQN_ (fully-qualified queue name) instead of just the name of the queue:
es_es: Para utilizar una cola de `MULTICAST`, es necesario proporcionar el _FQQN_ (nombre de cola totalmente calificado) en lugar de sólo el nombre de la cola:

source: To use it, add the following to your `build.gradle` file:
es_es: Para utilizarlo, añada lo siguiente a su archivo `build.gradle`:

source: To use the connector, you need to add the `quarkus-smallrye-reactive-messaging-amqp` extension.
es_es: Para utilizar el conector, es necesario añadir la extensión `quarkus-smallrye-reactive-messaging-amqp`.

source: To use the extension, add the dependency to the target project:
es_es: Para utilizar la extensión, añada la dependencia al proyecto de destino:

source: To use this authentication method, you should first enable SSL for your application. For more details, check the xref:http-reference.adoc#ssl[Supporting secure connections with SSL] guide.
es_es: Para utilizar este método de autenticación, primero debe habilitar SSL para su aplicación. Para más detalles, consulte la guía xref:http-reference.html#ssl[Soporte de conexiones seguras con SSL].

source: To use this base image, use the following `Dockerfile`:
es_es: Para utilizar esta imagen de base, utilice la siguiente dirección `Dockerfile`:

source: To use this feature, add the following extension to your project.
es_es: Para utilizar esta función, añada la siguiente extensión a su proyecto.

source: To use this feature, add the following extension to your project:
es_es: Para utilizar esta función, añada la siguiente extensión a su proyecto:

source: Today’s users embrace applications with milliseconds of response time, 100% uptime, lower latency, push data instead of pull, higher throughput, and elasticity. However, these features are nearly impossible to achieve using yesterday’s software architecture without a considerable investment in resources, infrastructure, and tooling. The world changed, and having dozens of servers, long response times (&gt; 500 ms), downtime due to maintenance or waterfalls of failures does not meet the expected user experience.
es_es: Los usuarios de hoy en día prefieren aplicaciones con un tiempo de respuesta de milisegundos, un tiempo de actividad del 100%, menor latencia, datos push en lugar de pull, mayor rendimiento y elasticidad. Sin embargo, estas características son casi imposibles de conseguir con la arquitectura de software de ayer sin una inversión considerable en recursos, infraestructura y herramientas. El mundo ha cambiado, y tener docenas de servidores, largos tiempos de respuesta (&gt; 500 ms), tiempos de inactividad por mantenimiento o cascadas de fallos no satisface la experiencia de usuario esperada.

source: Total Builds
es_es: Total de construcciones

source: Tracing & Debugging
es_es: Seguimiento y depuración

source: Traditional Java stacks were engineered for monolithic applications with long startup times and large memory requirements in a world where the cloud, containers, and Kubernetes did not exist. Java frameworks needed to evolve to meet the needs of this new world.
es_es: Los stack de Java tradicionales se diseñaron para aplicaciones monolíticas con largos tiempos de inicio y grandes requisitos de memoria en un mundo en el que no existían la nube, los contenedores ni Kubernetes. Los frameworks de Java debían evolucionar para satisfacer las necesidades de este nuevo mundo.

source: Two additional files are needed in your application's root directory:
es_es: Se necesitan dos archivos adicionales en el directorio raíz de su aplicación:

source: Type
es_es: Tipo

source: USAGE
es_es: USO

source: Unified Config
es_es: Configuración unificada

source: Unified configuration
es_es: Configuración unificada

source: Unifies Imperative and Reactive
es_es: Unifica lo imperativo y lo reactivo

source: Unifies imperative and reactive
es_es: Unifica lo imperativo y lo reactivo

source: Update
es_es: Actualización

source: Update Quarkus HTTP Port
es_es: Actualizar el puerto HTTP de Quarkus

source: Updating the https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/RedisClient.java[`RedisClient`] interface, i.e.:
es_es: Actualización de la https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/RedisClient.java[`RedisClient`] interfaz, es decir:

source: Updating the https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/reactive/ReactiveRedisClient.java[`ReactiveRedisClient`] interface, i.e.:
es_es: Actualización de la https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/reactive/ReactiveRedisClient.java[`ReactiveRedisClient`] interfaz, es decir:

source: Updating the https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/runtime/ReactiveRedisClientImpl.java[`ReactiveRedisClientImpl`], i.e.:
es_es: Actualizar el https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/runtime/ReactiveRedisClientImpl.java[`ReactiveRedisClientImpl`], es decir:

source: Updating the https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/runtime/RedisClientImpl.java[`RedisClientImpl`], i.e.:
es_es: Actualizar el https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/runtime/RedisClientImpl.java[`RedisClientImpl`], es decir:

source: Upload Container Image on Azure
es_es: Cargar la imagen del contenedor en Azure

source: Usage
es_es: Uso

source: Use Quarkus to build a Kafka Streams Application.
es_es: Utilice Quarkus para construir una aplicación de Kafka Streams.

source: Use Wiremock for Integration Testing
es_es: Utilizar Wiremock para las pruebas de integración

source: Use the <a href="https://github.com/quarkusio/quarkus/discussions">Discussions</a> section on our GitHub project.
es_es: Utilice la sección <a href="https://github.com/quarkusio/quarkus/discussions">Discusiones</a> de nuestro proyecto GitHub.

source: Use the Liquibase instance directly
es_es: Utilizar directamente la instancia de Liquibase

source: Use the Quarkus Spring Data REST compatibility layer to create a sample CRUD application.
es_es: Utilice la capa de compatibilidad REST de Quarkus Spring Data para crear una aplicación CRUD de ejemplo.

source: User `jdoe` has been assigned the role `NoRolesUser`
es_es: Al usuario `jdoe` se le ha asignado el rol `NoRolesUser`

source: User `jdoe` has password defined as `p4ssw0rd`
es_es: El usuario `jdoe` tiene una contraseña definida como `p4ssw0rd`

source: User `scott` has been assigned the roles `Admin`, `admin`, `Tester` and `user`
es_es: El usuario `scott` tiene asignados los roles `Admin`, `admin`, `Tester` y `user`

source: User `scott` has password `jb0ss`
es_es: El usuario `scott` tiene contraseña `jb0ss`

source: User `scott` has password defined as `jb0ss`
es_es: El usuario `scott` tiene una contraseña definida como `jb0ss`

source: User `scott` has roles `Admin`, `admin`, `Tester`, and `user`
es_es: El usuario `scott` tiene los roles `Admin`, `admin`, `Tester`, y `user`

source: User `stuart` has been assigned the roles `admin` and `user`.
es_es: El usuario `stuart` tiene asignados los roles `admin` y `user`.

source: User `stuart` has password `test`
es_es: El usuario `stuart` tiene contraseña `test`

source: User `stuart` has roles `admin` and `user`
es_es: El usuario `stuart` tiene los roles `admin` y `user`

source: Users.properties
es_es: Usuarios.propiedades

source: Using CI Environments
es_es: Uso de entornos de IC

source: Using Liquibase MongoDB
es_es: Uso de Liquibase MongoDB

source: Using RabbitMQ
es_es: Uso de RabbitMQ

source: Using Security with .properties File
es_es: Utilizando la seguridad con el archivo .properties

source: Using gRPC Health probes
es_es: Uso de las sondas gRPC Health

source: Using injection
es_es: Uso de la inyección

source: Using our Tooling
es_es: Utilización de nuestras herramientas

source: Using the Liquibase object
es_es: Uso del objeto Liquibase

source: Using the Quarkus Kubernetes extension, developers can perform or automate a single-step deployment using Jib, Docker, and Source-to-Image (S2i) including the creation of DeploymentConfig to trigger automatic redeployments. <a href="{{site.baseurl}}/guides/deploying-to-kubernetes">Read the guide for more details.</a>
es_es: Utilizando la extensión Kubernetes de Quarkus, los desarrolladores pueden realizar o automatizar un despliegue de un solo paso utilizando Jib, Docker y Source-to-Image (S2i), incluyendo la creación de DeploymentConfig para desencadenar redespliegues automáticos. <a href="{{site.baseurl}}/guides/deploying-to-kubernetes">Lee la guía para más detalles.</a>

source: Using the base image
es_es: Uso de la imagen base

source: Using the repository pattern
es_es: Uso del patrón de repositorio

source: Using xDS gRPC
es_es: Uso de xDS gRPC

source: Vault
es_es: Bóveda

source: Verify Maven is using the Java you expect
es_es: Verifique que Maven está usando el Java que espera

source: Video podcast hosted by Quarkus Developers about things moving in and around Quarkus ecosystem.
es_es: Podcast de vídeo presentado por los desarrolladores de Quarkus sobre las cosas que se mueven en el ecosistema de Quarkus y sus alrededores.

source: Videos
es_es: Vídeos

source: Visit the https://docs.microsoft.com/cli/azure/install-azure-cli?view=azure-cli-latest?WT.mc_id=opensource-quarkus-brborges[Azure CLI] installation page for instructions specific to your operating system.
es_es: Visite la página de instalación de https://docs.microsoft.com/cli/azure/install-azure-cli?view=azure-cli-latest?WT.mc_id=opensource-quarkus-brborges[Azure CLI] para obtener instrucciones específicas para su sistema operativo.

source: Visual Studio Code Extension For Quarkus
es_es: Extensión de código de Visual Studio para Quarkus

source: Visual Studio Code extension to install using the marketplace
es_es: Extensión de Visual Studio Code para instalar mediante el marketplace

source: Visualize and configure extensions as well as access to application logs and testing components
es_es: Visualizar y configurar las extensiones, así como acceder a los registros de la aplicación y a los componentes de prueba

source: Visualizing records
es_es: Visualización de registros

source: Want to have your extension added to the Quarkiverse?
es_es: ¿Quieres que tu extensión se añada a Quarkiverse?

source: Want to learn more? Check out the <a href='/guides/'>guides</a> to continue your journey.
es_es: ¿Quiere saber más? Consulta las <a href='/guides/'>guías</a> para continuar tu viaje.

source: Want to learn more? Check out the <a href='https://quarkus.io/guides/'>guides</a> to continue your journey
es_es: ¿Quiere saber más? Consulte las <a href='https://quarkus.io/guides/'>guías</a> para continuar su viaje

source: We are using `curl -w "\n"` in this example to avoid your terminal printing a '%' or put both result and next command prompt on the same line.
es_es: En este ejemplo utilizamos `curl -w "\n"` para evitar que su terminal imprima un '%' o ponga el resultado y el siguiente comando en la misma línea.

source: We do not recommend injecting contextual information specific to a runtime. Keep your functions portable.
es_es: No recomendamos inyectar información contextual específica de un tiempo de ejecución. Mantenga sus funciones portátiles.

source: We don’t want you to spend hours learning new technologies. Instead, the Quarkus programming model builds on top of proven standards. Be it official standards such as Eclipse MicroProfile or leading frameworks in a specific domain such as Eclipse Vert.x.
es_es: No queremos que pases horas aprendiendo nuevas tecnologías. En su lugar, el modelo de programación de Quarkus se basa en estándares probados. Ya sean estándares oficiales como Eclipse MicroProfile o marcos líderes en un dominio específico como Eclipse Vert.x.

source: We have a lot of documentation. Be sure to check our <a href="{{site.baseurl}}/get-started/">Getting started page</a>, and all our <a href="{{site.baseurl}}/guides/">guides</a>. Also check out our <a href="{{site.baseurl}}/faq/">FAQ section</a> and <a href="https://www.youtube.com/playlist?list=PLsM3ZE5tGAVbMz1LJqc8L5LpnfxPPKloO">Quarkus Tips Playlist</a>
es_es: Tenemos mucha documentación. Asegúrate de consultar nuestra <a href="{{site.baseurl}}/get-started/">página de inicio</a>, y todas nuestras <a href="{{site.baseurl}}/guides/">guías</a>. También echa un vistazo a nuestra <a href="{{site.baseurl}}/faq/">sección de preguntas</a>y <a href="https://www.youtube.com/playlist?list=PLsM3ZE5tGAVbMz1LJqc8L5LpnfxPPKloO">Lista de reproducción de consejos de Quarkus</a>
